src/cf/InformationRegisters/СостояниеНастройкиЗаполненияФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СостояниеНастройкиЗаполненияФормСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкаЗаполненияФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкаЗаполненияФормСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заполнять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтатистическогоНаблюдения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкаЗаполненияСвободныхСтрокФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкаЗаполненияСвободныхСтрокФормСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтатистическогоНаблюдения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияОбъектаНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовЭкономическойДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПродукцииПоВидамДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУслугНаселению</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостояниеНастройкиЗаполненияФормСтатистики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверяет что для формы статистики уже выполнялась настройка.
// Параметры:
//	ФормаСтатистики - СправочникСсылка.ФормыСтатистики - Форма для которой нужно выполнить проверку.
//	Организация - СправочникСсылка.Организации - Организация для которой нужно определить наличие настроек.
// Возвращаемое значение:
// Булево - Истина - Настройки для этой формы уже выполнялись, в противном случае Ложь.
//
Функция ВыполнялисьНастройкиФормы(ФормаСтатистики, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",     Организация);
	Запрос.УстановитьПараметр("ФормаСтатистики", ФормаСтатистики);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Выполнялись
	|ИЗ
	|	РегистрСведений.СостояниеНастройкиЗаполненияФормСтатистики КАК Настройки
	|ГДЕ
	|	Настройки.Организация = &Организация
	|	И Настройки.ФормаСтатистики = &ФормаСтатистики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.НастройкаЗаполненияФормСтатистики КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоляФормСтатистики КАК ПоляФормСтатистики
	|		ПО Настройки.ОбъектНаблюдения = ПоляФормСтатистики.СтатистическийПоказатель.Владелец
	|ГДЕ
	|	Настройки.Организация = &Организация
	|	И ПоляФормСтатистики.Владелец = &ФормаСтатистики
	|	И НЕ ПоляФормСтатистики.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоляФормСтатистики КАК ПоляФормСтатистики
	|		ПО Настройки.ОбъектНаблюдения = ПоляФормСтатистики.СтатистическийПоказатель.Владелец
	|ГДЕ
	|	Настройки.Организация = &Организация
	|	И ПоляФормСтатистики.Владелец = &ФормаСтатистики
	|	И НЕ ПоляФормСтатистики.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Устанавливает признак того что для формы статистики выполнялась настройка.
// Параметры:
//	ФормаСтатистики - СправочникСсылка.ФормыСтатистики - Форма для которой нужно записать признак.
//	Организация - СправочникСсылка.Организации - Организация для которой нужно записать признак.
//
Процедура ЗаписатьНастройкиВыполнены(ФормаСтатистики, Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.СостояниеНастройкиЗаполненияФормСтатистики.СоздатьМенеджерЗаписи();
	Запись.Организация     = Организация;
	Запись.ФормаСтатистики = ФормаСтатистики;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Запись.Организация     = Организация;
		Запись.ФормаСтатистики = ФормаСтатистики;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
